package model.enums;

/**
 * تگ‌های گیاهان که رفتارها و تعاملات را تعریف می‌کنند.
 * هر گیاه می‌تواند چند تگ داشته باشد.
 */
public enum PlantTag {
    DAY,            // مخصوص مراحل روز
    NIGHT,          // مخصوص مراحل شب/تاریک
    SHROOM,         // خانواده قارچ
    RAMP_UP,        // رشد تدریجی با گذر زمان
    PEA,            // خانواده نخود
    ICE,            // دارای مکانیزم یخ/سرما
    FIRE,           // دارای مکانیزم آتش/حرارت
    STACKABLE,      // قابلیت کاشت لایه‌ای
    CHARGE,         // نیاز به شارژ اولیه
    MAGIC,          // توانایی غیرفیزیکی (هیپنوتیزم و...)
    POISON,         // آسیب مستمر (DoT)
    WATER,          // مرتبط با آب
    AOE,            // آسیب مساحتی
    TRAP,           // تله (با نزدیک شدن زامبی فعال)
    MOVE_ZOMBIES,   // جابجاکننده زامبی‌ها
    SUN,            // تولیدکننده خورشید (غیر از دسته اصلی)
    EXPLOSIVE       // انفجار ثانویه
}
