package com.pvz2.model.enums;

/**
 * تگ‌های گیاهان که رفتارها و تعاملات را تعریف می‌کنند.
 * هر گیاه می‌تواند چند تگ داشته باشد.
 * نام‌ها باید با مقدارهای tags در فایل plants.json هماهنگ باشند.
 */
public enum PlantTag {

    DAY,              // مخصوص مراحل روز
    NIGHT,            // مخصوص مراحل شب/تاریک

    SHROOM,           // قارچ
    RAMP_UP,          // رشد تدریجی با گذر زمان
    PEA,              // مرتبط با نخود
    ICE,              // دارای مکانیزم یخ/سرما
    FIRE,             // دارای مکانیزم آتش/حرارت
    POISON,           // آسیب مستمر یا سمی

    STACK,            // قابلیت کاشت لایه‌ای یا روی گیاه/خانه دیگر
    CHARGE,           // نیازمند شارژ یا آماده‌سازی
    MAGIC,            // توانایی غیرفیزیکی مثل هیپنوتیزم
    WATER,            // مرتبط با آب
    AOE,              // اثر یا آسیب مساحتی
    TRAP,             // تله
    MOVE_ZOMBIES,     // جابه‌جاکننده زامبی‌ها
    SUN,              // مرتبط با تولید یا دریافت خورشید
    EXPLOSIVE,        // انفجاری
    INSTANT,          // مصرفی آنی و یک‌بارمصرف

    MINT,             // مربوط به گیاهان mint
    LOBBER,           // مربوط به خانواده پرتاب‌کننده‌ها
    MELEE,            // مربوط به مبارزان نزدیک‌زن
    WALL_NUT,         // مربوط به خانواده دیواری/دفاعی
    STRIKE_THROUGH,   // مربوط به گیاهان نفوذکننده
    HOMING            // مربوط به گیاهان هدف‌یاب
}